# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Vitali\Documents\PSoC Creator\Expo_Controller_Workspace\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Sun, 22 Nov 2015 17:59:55 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 718.75 -waveform {0 359.375} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 62.5 -waveform {0 15.625} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 23 47} [list]


# Component constraints for C:\Users\Vitali\Documents\PSoC Creator\Expo_Controller_Workspace\Bootloader_PSoC4_Example01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Vitali\Documents\PSoC Creator\Expo_Controller_Workspace\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Sun, 22 Nov 2015 17:59:54 GMT
